---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CableTraySettings.GetCableTraySettings(Autodesk.Revit.DB.Document)
source: html/e69ccddc-8380-90e7-6395-ea75ac4f7826.htm
---
# Autodesk.Revit.DB.Electrical.CableTraySettings.GetCableTraySettings Method

Gets the cable tray settings of the project.

## Syntax (C#)
```csharp
public static CableTraySettings GetCableTraySettings(
	Document document
)
```

## Parameters
- **document** (`Autodesk.Revit.DB.Document`) - The document.

## Returns
The cable tray settings of the project.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null